## Staging: glue 🧴
**✅ &nbsp; Terraform Init:** `success`
**✅ &nbsp; Terraform Validate:** `success`
**✅ &nbsp; Terraform Format:** `success`
**✅ &nbsp; Terraform Plan:** `success`
**✅ &nbsp; Conftest:** `success` 

```terraform
Plan: 1 to add, 3 to change, 0 to destroy
```

<details>
<summary>Show summary</summary>

| CHANGE |                      NAME                       |
|--------|-------------------------------------------------|
| update | `aws_glue_job.platform_gc_notify_job`           |
|        | `aws_s3_object.platform_gc_notify_job`          |
|        | `aws_s3_object.platform_gc_notify_requirements` |
| add    | `aws_s3_object.platform_gc_notify_gx`           |


</details>


<details>
<summary>Show plan</summary>

```terraform
Resource actions are indicated with the following symbols:
  + create
  ~ update in-place

Terraform will perform the following actions:

  # aws_glue_job.platform_gc_notify_job will be updated in-place
  ~ resource "aws_glue_job" "platform_gc_notify_job" {
      ~ default_arguments         = {
          + "--gx_config_object"                 = "s3://cds-data-lake-glue-staging/platform/gc_notify/gx.zip"
            # (19 unchanged elements hidden)
        }
        id                        = "Platform / GC Notify"
        name                      = "Platform / GC Notify"
        tags                      = {}
        # (16 unchanged attributes hidden)

        # (2 unchanged blocks hidden)
    }

  # aws_s3_object.platform_gc_notify_gx will be created
  + resource "aws_s3_object" "platform_gc_notify_gx" {
      + acl                    = (known after apply)
      + arn                    = (known after apply)
      + bucket                 = "cds-data-lake-glue-staging"
      + bucket_key_enabled     = (known after apply)
      + checksum_crc32         = (known after apply)
      + checksum_crc32c        = (known after apply)
      + checksum_crc64nvme     = (known after apply)
      + checksum_sha1          = (known after apply)
      + checksum_sha256        = (known after apply)
      + content_type           = (known after apply)
      + etag                   = "35dfd140b1a6c086fac58540189b6b99"
      + force_destroy          = false
      + id                     = (known after apply)
      + key                    = "platform/gc_notify/gx.zip"
      + kms_key_id             = (known after apply)
      + server_side_encryption = (known after apply)
      + source                 = "./etl/platform/gc_notify/gx.zip"
      + storage_class          = (known after apply)
      + tags_all               = {
          + "CostCentre" = "PlatformDataLake"
          + "Terraform"  = "true"
        }
      + version_id             = (known after apply)
    }

  # aws_s3_object.platform_gc_notify_job will be updated in-place
  ~ resource "aws_s3_object" "platform_gc_notify_job" {
      ~ etag                          = "205252f566ee073469688010bf8efd4c" -> "0c75dfc4534411d9c18d694d2492fbc9"
        id                            = "platform/gc_notify/process_data.py"
        tags                          = {}
      ~ version_id                    = "fLyOsSWhYZwdlRQu9Cuvle1o769Rafz2" -> (known after apply)
        # (24 unchanged attributes hidden)
    }

  # aws_s3_object.platform_gc_notify_requirements will be updated in-place
  ~ resource "aws_s3_object" "platform_gc_notify_requirements" {
      ~ etag                          = "94d18cc6f3c8e50a1e3a988e78e6a849" -> "a6cf35ad25841f1de7909912c6b12b1c"
        id                            = "platform/gc_notify/requirements.txt"
        tags                          = {}
      ~ version_id                    = "0EnsZDAU.YdLNfWqeyuKe83NEiAWRyjt" -> (known after apply)
        # (24 unchanged attributes hidden)
    }

Plan: 1 to add, 3 to change, 0 to destroy.

─────────────────────────────────────────────────────────────────────────────

Saved the plan to: plan.tfplan

To perform exactly these actions, run the following command to apply:
    terraform apply "plan.tfplan"

```

</details>

<details>
<summary>Show Conftest results</summary>

```sh
WARN - plan.json - main - Missing Common Tags: ["aws_glue_catalog_database.bes_crm_salesforce_production"]
WARN - plan.json - main - Missing Common Tags: ["aws_glue_catalog_database.operations_aws_production"]
WARN - plan.json - main - Missing Common Tags: ["aws_glue_catalog_database.operations_aws_production_raw"]
WARN - plan.json - main - Missing Common Tags: ["aws_glue_catalog_database.platform_gc_forms_production"]
WARN - plan.json - main - Missing Common Tags: ["aws_glue_catalog_database.platform_gc_forms_production_raw"]
WARN - plan.json - main - Missing Common Tags: ["aws_glue_catalog_database.platform_gc_notify_production"]
WARN - plan.json - main - Missing Common Tags: ["aws_glue_catalog_database.platform_support_production"]
WARN - plan.json - main - Missing Common Tags: ["aws_glue_catalog_database.platform_support_production_raw"]
WARN - plan.json - main - Missing Common Tags: ["aws_glue_crawler.operations_aws_production_account_tags"]
WARN - plan.json - main - Missing Common Tags: ["aws_glue_crawler.operations_aws_production_cost_usage_report"]
WARN - plan.json - main - Missing Common Tags: ["aws_glue_crawler.platform_gc_forms_templates_production_raw"]
WARN - plan.json - main - Missing Common Tags: ["aws_glue_crawler.platform_support_freshdesk_production"]
WARN - plan.json - main - Missing Common Tags: ["aws_glue_job.bes_crm_salesforce"]
WARN - plan.json - main - Missing Common Tags: ["aws_glue_job.platform_gc_forms_job"]
WARN - plan.json - main - Missing Common Tags: ["aws_glue_job.platform_gc_notify_job"]
WARN - plan.json - main - Missing Common Tags: ["aws_glue_job.platform_support_freshdesk"]
WARN - plan.json - main - Missing Common Tags: ["aws_glue_trigger.bes_crm_salesforce"]
WARN - plan.json - main - Missing Common Tags: ["aws_glue_trigger.platform_gc_forms_job"]
WARN - plan.json - main - Missing Common Tags: ["aws_glue_trigger.platform_gc_notify_job"]
WARN - plan.json - main - Missing Common Tags:...
```

</details>
